{
  "name": "demo_ray_job_3dmol",
  "description": "This model generates protein binders based on an input .pdb file and optional additional prompting. \nBinders are generated by combining a conditional protein structure diffusion model (RFDiffusion) with an inverse folding model (ProteinMPNN). After generation, candidates are evaluated using a protein folding model (AF Multimer via Colabfold).\nThe model's output is a set of candidate binders with .pdb files for each candidate and corresponding scoring metrics.",
  "guide": "Note: steps marked (optional) and (advanced) give additional constraints for the designs but it is not necessary to add/edit their input in order to submit an experimental run.\n\n1. Select a .pdb file containing the *target protein* you would like to design a binder against.\n2. Specify a *target chain* from the pdb file.\n3. (optional) Define *hotspot* residues on the target chain as the binding sites, stating the target chain ID followed by the residue index (e.g. A30).\n4. (optional) Specify the *binder length* (total number of residues) you wish to design.\n5. (optional) Define an *expert prompt* to crop the target and refine the binder design specs. The prompt string has to respect the following syntax. First, information on the target is specified. This is done by specifying the target chain ID followed by the indices of the first and last residue of a cropped region on the target chain (e.g. A20:110). For the binder the following information can be provided. First, residues of the binder chain to hold fixed (aka scaffold) during design. These are specified by the binder chain ID followed by an index range (e.g. B6:9, or B6:6 for a single fixed residue). Second, segments of residues for free design. Use small *x* followed by the number of residues to be designed (e.g. x15). Different parts of the prompt are separated by */*. Providing a prompt, overwrites other inputs.\n6. (optional) Crop the target structure by specifying the *start residue* and *end residue* on the target chain.",
  "author": "sokrypton",
  "github": "https://github.com/sokrypton/ColabDesign",
  "paper": "https://www.nature.com/articles/s41586-023-06415-8",
  "task": "protein design",
  "taskCategory": "protein-binder-design",
  "modelType": "ray",
  "rayEndpoint": "/api/jobs/",
  "rayJobEntryPoint": "python demo.py",
  "checkpointCompatible": true,
  "xAxis": "plddt",
  "yAxis": "i_pae",
  "jobType": "job",
  "metricsDescription": "*Stability Score:* larger value indicates higher confidence in the predicted local structure\n*Affinity Score:* larger value indicates higher confidence in the predicted interface structure\n*Note:* designs which lie within the green square are recommended for laboratory testing",
  "computeCost": 50,
  "inputs": {
    "target_chain": {
      "type": "string",
      "description": "Chain ID of the relevant target protein in the PDB file. Assuming A as target chain ID unless provided otherwise.",
      "array": false,
      "glob": [
        ""
      ],
      "default": "A",
      "min": "",
      "max": "",
      "example": "A",
      "grouping": "target",
      "position": "102",
      "required": true
    },
    "binder_length": {
      "type": "number",
      "description": "The length of the generated protein binder candidates.",
      "array": false,
      "glob": [
        ""
      ],
      "default": "",
      "min": "0",
      "max": "1000",
      "example": "80",
      "grouping": "target",
      "position": "104",
      "required": false
    },
    "target_start_residue": {
      "type": "number",
      "description": "Use this setting to crop the target chain for faster binder generation. Integer index defining the first residue of a cropped section on the target chain.",
      "array": false,
      "glob": [
        ""
      ],
      "default": "",
      "min": "0",
      "max": "",
      "example": "20",
      "grouping": "_advanced",
      "position": "201",
      "required": false
    },
    "target_end_residue": {
      "type": "number",
      "description": "Use this setting to crop the target chain for faster binder generation. Integer index defining the last residue of a cropped section on the target chain.",
      "array": false,
      "glob": [
        ""
      ],
      "default": "",
      "min": "0",
      "max": "",
      "example": "120",
      "grouping": "_advanced",
      "position": "202",
      "required": false
    },
    "expert_prompt_for_refined_binder_design": {
      "type": "string",
      "default": "",
      "description": "Use this setting for advanced prompts to crop and scaffold protein chains. For motif scaffolding, specify the chain ID of the motif followed by a range of residue indices. For free design, write x followed by the number of residues to generate. The prompt overrides all other GUI inputs.",
      "example": "A10:110/B4:5/x6/B9:50/x51",
      "grouping": "_advanced",
      "position": "203",
      "required": false
    }
  },
  "outputs": {
    "string_message": {
      "type": "File",
      "glob": ["*.json"]
    }
  }
}
